### Задание1
### Напишите программу, которая запрашивает у пользователя три числа в диапазоне
### 1-1000. Компьютер генерирует два случайных числа в диапазоне 1-100, которые
### определяют отрезок. Определить какие числа указанные пользователям попали в
### отрезок.

```
import random

a=(int(input("введите первое число", )))
b=(int(input("введите второе число", )))
c=(int(input("введите третье число", )))

q=(int(random.randint(1,100)))
w=(int(random.randint(1,100)))
print(a,b,c,q,w)


f=[q,w]
f.sort()

print(f)

if a>f[0] and a<f[1]:
    print("число попало в диапазон",a),
elif b>f[0] and b<f[1]:
    print("число попало в диапазон",b),
elif c>f[0] and c<f[1]:
    print("число попало в диапазон",c),
else:
    print("число не попало")

```

### Задание2
### Напишите программу, которая у пользователя запрашивает два числа. Находит
### произведение чисел, если оба числа четные. Находит сумму двух чисел если оба числа
### нечетные. Находит максимум из двух чисел если одно число нечетное, а другое четное.
### Находит деление двух чисел, если одно число является делителем второго числа.
### Результат вывести на экран

```

import random

a=(int(input("введите первое число", )))
b=(int(input("введите второе число", )))

f=[a,b]
f.sort()

print(f)

if a % 2 == 0 and b % 2 == 0:
    print(a*b)
elif a % 2 > 0 and b % 2 > 0:
    print(a+b)
elif a % b == 0:
    print(a/b)
elif b % a ==0:
    print(b/a)
elif a % 2 > 0:
    print(f[1])
elif b % 2 > 0:
    print(f[1])
else:
    print("введены не верные значения")

```
### Задание4
### Напишите программу, которая определяет пройдет коробка с размерами a*b*c в
### ящик с размерами x*y*z


```
import random
a=(int(input("введите длину коробки", )))
b=(int(input("введите высоту коробки", )))
c=(int(input("введите ширину коробки", )))

x = (int(input("введите длину ящика", )))
y = (int(input("введите высоту ящика", )))
z = (int(input("введите ширину ящика", )))

print(a,b,c,x,y,z)


if a <= x and b <= y and c <= z:
    print("пройдёт")
elif x>= b and y>= a and z >= c:
    print("пройдёт")
else:
    print("не пройдёт")


```
### Задание5
### Напишите программу, которая у пользователя запрашивает одно число. Находит
### делители данного числа от 2 до 10 и выводит на экран найденные делители

```
a=(int(input("введите число", )))

for i in  range(2,11):
    if a % i == 0:
        print(i)

```
