### Задача 1 Написать программу: дан список из 10 чисел, которые задаются с помощью
### датчика случайных чисел в диапазоне 1-10. Программа находит повторяющиеся
### элементы и удаляет их из списка. Например, дан список (1,1,1,2,3,4,2,3,4) результат (1,2,3,4)

## первое перешение.

```
import random
a=[]
for i in range(10):
    b = (random.randint(1,100))
    a.append(b)
a=set(a)
print(a)
```


## второе решение
```
import random
a=[]
for i in range(10):
    b = (random.randint(1,100))
    a.append(b)
c=[]
for j in a:
    if j not in c:
        c.append(j)
print(c)
```