### Задача 1 Написать программу: дан список из 10 чисел, которые задаются с помощью
### датчика случайных чисел в диапазоне 1-10. Программа находит повторяющиеся
### элементы и удаляет их из списка. Например, дан список (1,1,1,2,3,4,2,3,4) результат (1,2,3,4)

## первое перешение.

```
import random
a=[]
for i in range(10):
    b = (random.randint(1,100))
    a.append(b)
a=set(a)
print(a)
```


## второе решение
```
import random
a=[]
for i in range(10):
    b = (random.randint(1,100))
    a.append(b)
c=[]
for j in a:
    if j not in c:
        c.append(j)
print(c)
```

### Задача 2 : Написать программу: дан список из 10 чисел, которые задаются с помощью
### датчика случайных чисел. Программа находит повторяющиеся элементы и считает
### количество повторений. Например дан список (1,1,1,2,3,4,2,3,4) результат число 1
### повторяется 3 раза, число 2 – 2раза, число 3 - 2 раза, число 4 – 2 раза

```
import random
a=[]
for i in range(10):
    b = (random.randint(1,100))
    a.append(b)
print(a)

for elemets in a:
    v=a.count(elemets)
    print("число: ",elemets)
    print("встречается раз: ",v)

вываод
[25, 59, 80, 12, 73, 54, 78, 60, 80, 67]
число:  25
встречается раз:  1
число:  59
встречается раз:  1
число:  80
встречается раз:  2
число:  12
встречается раз:  1
число:  73
встречается раз:  1
число:  54
встречается раз:  1
число:  78
встречается раз:  1
число:  60
встречается раз:  1
число:  80
встречается раз:  2
число:  67
встречается раз:  1

```

### Задача 3 Дан список некоторых целых чисел, найдите значение 20 в нем и, если оно
### присутствует, замените его на 200 Обновите список только при первом вхождении числа 20

```
import random
a=[]
for i in range(10):
    b = (random.randint(1,100))
    a.append(b)

print(a)
for j in a:
    if j == 20:
        w=a.index(20)
        a[w]=200
    else:
        print ("20 не обнаружено ")
print(a)

Примчечание если делать через index выпадает в ошибку при не нахождении данного числа 
```
